Repository: f0nzie/machine-learning-rsuite
Catalog: packages/tree/po/R-*.po
Languages: pl

source: trees cannot handle interaction terms
pl: drzewa nie mogą obłużyć członów interakcji

source: trees cannot handle multiple responses
pl: drzewa nie mogą obsłużyć wielu odpowiedzi

source: offset not implemented for classification trees
pl: przesunięcie nie jest zaimplementowane dla drzew klasyfikacyjnych

source: no observations from which to fit a model
pl: brak obserwacji z których dopasować model

source: control$nobs < number of observations in data
pl: control$nobs < liczba obserwacji w danych

source: can not prune singlenode tree
pl: nie można przyciąć drzewa o pojedynczym węźle

source: not legitimate tree
pl: niepoprawne drzewo

source: misclass only for classification trees
pl: 'misclass' tylko dla drzew klasyfikacyjnych

source: best is bigger than tree size
pl: 'best' jest większe niż rozmiar drzewa

source: only for classification trees
pl: tylko dla drzew klasyfikacyjnych

source: type "class" only for classification trees
pl: typ "class" tylko dla drzew klasyfikacyjnych

source: observations omitted due to missing values in the response
pl: pominięto obserwacje z uwagi na brakujące wartości w zmiennej zależnej

source: observations omitted due to missing values in the supplied weights
pl: pominięto obserwacje z uwagi na brakujące wartości w dostarczonych wagach

source: continuous variable
pl: ciągłe zmienne

source: contained NAs
pl: zawarte wartości NA

source: retrieving data from
pl: pozyskiwanie danych z

source: misclassification error rate is appropriate for factor responses only
pl: błąd współczynnika niepoprawnej klasyfikacji jest odpowiedni jedynie dla czynników zależnych

source: supplied nodes
pl: dostarczone węzły

source: are not in this tree
pl: nie są w tym drzewie

source: are leaves
pl: są liśćmi

source: wrong variable numbers in tree.
pl: błędne liczby zmiennych w drzewie.

source: cannot plot singlenode tree
pl: nie można narysować drzewa o jednym węźle

source: tree can only have one or two predictors
pl: drzewo może mieć jedną lub dwie zmienne predykcyjne

source: tree can only have continuous predictors
pl: drzewa mogą mieć jedynie ciągłe zmienne predykcyjne

source: unmatched names in vars
pl: niedopasowane nazwy w zmiennych

source: cannot snip singlenode tree
pl: nie można przyciąć drzewa o jednym węźle

source: label must be a column label of the frame component of the tree
pl: 'label' musi być etykietą kolumny komponentu ramki drzewa

source: cannot tile singlenode tree
pl: nie można pokryś drzewa o jednym węźle

source: variable length must match that of data used in fit
pl: długość zmiennej musi zgadzać się z daną użytą w dopasowaniu

source: need to use split.screen first
pl: potrzeba użyć najpierw split.screen

source: mincut cannot be greater than minsize/2
pl: mincut nie może być większe niż minsize/2
